Revit 2024 API
DuctFittingAndAccessoryPressureDropData Members
The DuctFittingAndAccessoryPressureDropData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DuctFittingAndAccessoryPressureDropData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDuctFittingAndAccessoryData
 Returns the fitting and accessory information.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPresureDropItems
 Returns the pressure drop items.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetDefaultEntity
 Stores the default entity in the data.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CalculationType
 The calculation type, a bitmask of FittingAndAccessoryCalculationType.
IsCurrentEntityValid
 True if the current settings stored in the entity is valid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace